; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v6 - type_2 ?v7 - type_1)
 	      (pred_3 ?v8 - object ?v7 - type_1)
	      (pred_2 ?v6 - type_2 ?v3 - type_3)
	      (pred_1 ?v6 - type_2 ?v8 - object ?v3 - type_3))

   (:action op_2
       :parameters  (?v6 - type_2 ?v1 ?v2 - type_1)
       :precondition (and  (pred_4 ?v6 ?v1))
       :effect (and  (pred_4 ?v6 ?v2)
		     (not (pred_4 ?v6 ?v1))))

   (:action op_1
       :parameters (?v6 - type_2 ?v5 - object ?v4 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v4) (pred_4 ?v6 ?v4) (pred_2 ?v6 ?v3))
       :effect (and (pred_1 ?v6 ?v5 ?v3)
		    (not (pred_3 ?v5 ?v4)) 
		    (not (pred_2 ?v6 ?v3))))

   (:action op_3
       :parameters (?v6 - type_2 ?v5 - object ?v4 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v5 ?v3) (pred_4 ?v6 ?v4))
       :effect (and (pred_3 ?v5 ?v4)
		    (pred_2 ?v6 ?v3)
		    (not (pred_1 ?v6 ?v5 ?v3)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_12 obj_03 - type_2
obj_02 obj_04 obj_08 obj_09 - type_3
obj_05 obj_01 obj_11 - type_1
obj_06 obj_07 obj_10 - object)
(:init
(pred_4 obj_12 obj_05)
(pred_2 obj_12 obj_02)
(pred_2 obj_12 obj_04)
(pred_4 obj_03 obj_01)
(pred_2 obj_03 obj_08)
(pred_2 obj_03 obj_09)
(pred_3 obj_06 obj_11)
(pred_3 obj_07 obj_05)
(pred_3 obj_10 obj_05)
)
(:goal
(and
(pred_3 obj_06 obj_05)
(pred_3 obj_07 obj_05)
(pred_3 obj_10 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_12 obj_11)))
)
)

; plan
1. (op_1 obj_12 obj_10 obj_05 obj_04)
   deleted: (pred_3 obj_10 obj_05) (pred_2 obj_12 obj_04)
   added: (pred_1 obj_12 obj_10 obj_04)
   goals met: 1 of 3
2. (op_2 obj_03 obj_01 obj_11)
   deleted: (pred_4 obj_03 obj_01)
   added: (pred_4 obj_03 obj_11)
   goals met: 1 of 3
3. (op_1 obj_03 obj_06 obj_11 obj_09)
   deleted: (pred_3 obj_06 obj_11) (pred_2 obj_03 obj_09)
   added: (pred_1 obj_03 obj_06 obj_09)
   goals met: 1 of 3
4. (op_2 obj_03 obj_11 obj_05)
   deleted: (pred_4 obj_03 obj_11)
   added: (pred_4 obj_03 obj_05)
   goals met: 1 of 3
5. (op_3 obj_03 obj_06 obj_05 obj_09)
   deleted: (pred_1 obj_03 obj_06 obj_09)
   added: (pred_3 obj_06 obj_05) (pred_2 obj_03 obj_09)
   goals met: 2 of 3
6. (op_3 obj_12 obj_10 obj_05 obj_04)
   deleted: (pred_1 obj_12 obj_10 obj_04)
   added: (pred_3 obj_10 obj_05) (pred_2 obj_12 obj_04)
   goals met: 2 of 3
7. (op_1 obj_03 obj_10 obj_05 obj_09)
   deleted: (pred_3 obj_10 obj_05) (pred_2 obj_03 obj_09)
   added: (pred_1 obj_03 obj_10 obj_09)
   goals met: 2 of 3
8. (op_2 obj_03 obj_05 obj_11)
   deleted: (pred_4 obj_03 obj_05)
   added: (pred_4 obj_03 obj_11)
   goals met: 2 of 3
9. (op_3 obj_03 obj_10 obj_11 obj_09)
   deleted: (pred_1 obj_03 obj_10 obj_09)
   added: (pred_3 obj_10 obj_11) (pred_2 obj_03 obj_09)
   goals met: 3 of 3
